//package Homework.Lesson23.Test1.p2;
//
//
//// Test 1
//// Ответ: Результат работы программы будет 'Y'
//// Верно
//
//// По разбору не верно, но ведь работает......
//// должна быть оштбка на моменте создания объекта, т.к.
//// должен вызываться конструктор класса Х, который не виден в классе У
//
//public class Y {
//    Y () {}
//    public void abc() {
//        System.out.println('Y');
//    }
//
//    public static void main(String[] args) {
//        Y y = new Y();
//        y.abc();
//    }
//
//
//}
